artillery/load-test.yml
config:
  target: "http://192.168.50.30"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: "Warm up"
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up"
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"

scenarios:
  - name: "Create, get and delete users"
    flow:
      - post:
          url: "/api/users"
          json:
            username: "prueba4"
            password: "1234"
          capture:
            json: "$.id"
            as: "iduser"
      - get:
          url: "/api/users"
  
  - name: "Login user"
    flow:
      - post:
          url: "/api/login"
          json:
            username: "prueba4"
            password: "1234"
          capture:
            json: "$.user_id"
            as: "userid"

  - name: "Create, get and delete books"
    flow:
      - post:
          url: "/api/books"
          json:
            userid: "{{ userid }}"
            title: "Test Book"
            author: "Author Name"
            year: 2021
            synopsis: "A brief synopsis of the book."
            editorial: "Editorial Name"
          capture:
            json: "$.id"
            as: "bookid"
      - get:
          url: "/api/books/{{ bookid }}"
      - get:
          url: "/api/books"
      - delete:
          url: "/api/books/{{ bookid }}"
      - get:
          url: "/api/books/users/{{ userid }}"